---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailExtensionStyle.Post
enum: Autodesk.Revit.DB.Architecture.RailExtensionStyle
source: html/04ad8fa3-fd3b-33a5-e19a-75447ec3b1a4.htm
---
# Autodesk.Revit.DB.Architecture.RailExtensionStyle.Post

The rail extends to post.